[
	{
      	"title" : "Is Bigger Always Better?",
        "categories" : ["life, work"],
        "date": "2014-Sept-30",
        "post_body" : "Big data is a buzz word being thrown around across all industries.  Any student I find on campus will have a thing or two to say about big data and their thoughts on its influences, and everyone has a different fantasty on how big data will carve and mould our world.  The adjective 'big' in big data rightfully describes the recent trend of expolosive growth and availability of public and personal data, fueled by information-centered companies like Google and Facebook.  Most people believe that big data is important to all areas of society - from business to government to healthcare to foreign policies - and that this new availability of data will help us make better predictions and analyses in every field.  I agree.  Big data will be tremendously beneficial to many fields, but every story has a flip side.  <br><br>  Rewind to the year 2000, when America experienced it's greatest fraud-related bankrupty caused by the country's most admired company,  Enron.  Through clever manipulation of their accounting records, Enron had consistently recorded profits year after year, deceiving the public into thinking Enron was healthy and booming when infact, Enron was losing tens of millions regularly due to poor deals and failed projects.  While many analysts have concluded this fraud would've been exposed sooner had there been more information, Malcolm Gladwell writes a great piece in his book 'What the Dog Saw' arguing the problem wasn't too much data.  Rather, there was so much public data available that the important, meaninful numbers were completely hidden behind a thick veil of junk and noise. <br><br>  Sometimes, the simplest solution is the best solution.  Before big data, the equation was simply y=mx+b.  Easy.  Now, k and n and q and r have been introduced.  The equation may become more accurate, but it could also become diluated with noise and falsely identified relationships.  Again, I am by no means against big data, and I think this field will continue to make positive contributions to humanity.  I do however, ask that everyone be cautious even when they think they have all the data they need - Bigger is not always better."  
    }
]
