[

	{
		"title" : "Practical Drones",
        "categories" : ["life, work"],
        "date": "2014-Nov-17",
        "post_body" : "While most citizens associate automated drones and robots with warfare, the annoucement made by Jeff Bezos last Christmas planning to use drones for package delivery stirred up countless debates over the country.  Though a sky full of package delivering drones may seem far-fetched in the near future, all these conversations helped me realize some stunning possibilities that will become reality in a drone-packed world. <br><br>  1. Emergency Response <br>  Being the victim of a recent house robbery, I've had fantasies of robotic police drones that respond immediately to 9-11 calls.  While gun carrying drones may be more dangerous than beneficial, drones that are able to follow robbery or murder suspects and capture an image of their face (yay OpenCV!) would be a valuable asset to any police department.  This would also be great for firefighters, who can now send a flying drone into a house to detect important chemical levels and find any potential survivors before putting their own lives in danger.  For health emergencies such as strokes or heart attacks, a drone can carry vital medical equipment to the patient.  The biggest disadvantage of modern ambulances is traffic - In a situation where a minute determines life and death, there is not a second to waste.  Unlike ambulances, drones can take a straight line route from point A to point B, drastically decreasing the amount of travel time. <br><br> 2. Search and rescue <br> Next time somebody gets stranded on a mountain after a heavy snowfall, drones can be put into action.  Potential applications I can see are resource delivery (ex. water and food) and using cameras or thermal vision to locate survivors.  However, a key concern of mine is something I encountered during my recent work on OpenCV with my engineering team, UBC Sailbots.  Fog and smoke can completely obstruct the vision of both regular and thermal cameras, making their captured images completely useless.  This problem needs to be solved before drones can be effectively deployed in these extreme weather conditions. <br><br> 3. Remote Monitoring and Mapping <br> Using commercial drones, large masses of land can now be captured on video and this information can help in fields such as agriculture, environmental preservation, and asset monitoring.  Companies can now purchase these drones to monitor their ships as the cruise across an ocean, providing real-time feedback on the situation.  Safaris can use these drones to add surveillence to the skies, preventing poachers from illegal poaching.  This mapping technology can also be turned into it's 3D form, where drones can be used to accurately map the 3D image of a building or other physical monument.  <br><br>  Of course, there are only a few potential applications and I am certain there will be countless new drone innovations coming in the next decade.  Awesome startups such as Airware, Spire, and Skycatch are all companies seeking to make an impact in this field and I can't wait to see what they accomplish next!"
	},

    {
        "title" : "A Quote to Conclude The Week...",
        "categories" : ["life, work"],
        "date": "2014-Nov-02",
        "post_body" : "What Orwell feared were those who would ban books. What Huxley feared was that there would be no reason to ban a book, for there would be no one who wanted to read one. Orwell feared those who would deprive us of information. Huxley feared those who would give us so much that we would be reduced to pasivity and egoism. Orwell feared that the truth would be concealed from us. Huxley feared the truth would be drowned in a sea of irrelevance. Orwell feared we would become a captive culture. Huxley feared we would become a trivial culture, preoccupied with some equivalent of the feelies, the orgy porgy, and the centrifugal bumble-puppy. As Huxley remarked in Brave New World Revisited, the civil libertarians and rationalists who are ever on the alert to oppose tyranny \"failed to take into account humanity's almost infinite appetite for distractions.\" In 1984, people are controlled by inflicting pain. In Brave New World, they are controlled by inflicting pleasure. In short, Orwell feared that what we hate will ruin us. Huxley feared that what we love will ruin us. <br><br> -Neil Postman"
    }
]
